{
    "beginnings": [
        {
            "scenario": "<p>A shot in the dark. That is literally what it was. We were hurtling through space in a very specific concoction of pseudoscience, sci-fi, trigonometry and probably astrology.</p><p>Our life raft held together with Hubba Bubba and Pritt Stick.</p><p>We slept through it all. Raised by ghosts, educated on dreams and fed a desperate hope for the future. We were taught what went wrong in order to know what could have been. Consequences, consequences, consequences. That’s what they drilled into us.</p><p>But when we arrived we were teenagers. We were born into our adult bodies with a wealth of knowledge and absolutely no life experience. Awkward, spotty innocents. What did we care for consequences, when we’d lived our whole lives asleep? We had dreams to realise.</p><p>It was funny. As we floated through the night sky, there was one we all shared.</p>",
            "choices": [
                {
                    "choice": "Falling from our arc and hurtling towards the surface.",
                    "outcome": "",
                    "stats": {
                        "happiness": 10
                    },
                    "eval": ""
                },
                {
                    "choice": "An unknown land, where we were hunted by monsters.",
                    "outcome": "",
                    "stats": {},
                    "eval": ""
                },
                {
                    "choice": "Waking up alone, the last of our species.",
                    "outcome": "",
                    "stats": {},
                    "eval": ""
                }
            ]
        },
        {
            "scenario": "<p>We didn’t know it at the time but we woke from one arc and ended up on another. In this world, it was as though Noah never tasted the rainbow and whatever species had lived here, God drowned the lot of them. It was one huge sea as wide as the eye could see.</p><p>I remember donning a pair of sick shades, wobbling out into the twin suns and failing to look cool as I found my sea legs. I was drenched in seconds, battered as we were by an ostentatious ocean. All the while, the ground beneath us was rising and falling, causing many of my fellow travellers to empty their all-ready rumbling stomachs. A fairly sizeable crab almost took my left baby toe, so we ate his family for lunch with a seaweed salad.</p><p>It was salty. Everything in the beginning was too salty.</p><p>Later, when the suns we dubbed the Gemini set, the sky erupted into an explosion of oranges, purples and reds. It was chilly when the darkness came, and it was too wet for a fire.</p>",
            "choices": [
                {
                    "choice": "As we shivered in the night, we felt loneliness for the first time.",
                    "outcome": "",
                    "stats": {},
                    "eval": ""
                },
                {
                    "choice": "We held each other, sheltered in the embrace of a trio of giant barnacles.",
                    "outcome": "",
                    "stats": {
                        "happiness": 10,
                        "community": 10
                    },
                    "eval": ""
                },
                {
                    "choice": "Some of us found a hot pool and our skin wrinkled, snug beneath the surface.",
                    "outcome": "",
                    "stats": {},
                    "eval": ""
                }
            ]
        },
        {
            "scenario": "<p>Our ancestors weren’t big on plastic and they forgot to pack the birth control pills. Leave a society of randy adolescents on a new planet unsupervised, they are going to sleep around. Most of us weren’t really sure whose was whose, so we just kind of all took responsibility for the children.</p><p>In those early days, the population levels just kind of stagnated. It was a bit of a learning curve and there was a lot of trial and error. Not knowing which creatures would love to devour your insides, or which fruits would turn your skin purple, it’s a wonder that we survived at all.</p><p>I don’t think, given the world we found ourselves in, I could have found myself doing anything else.</p>",
            "choices": [
                {
                    "choice": "Someone had to keep us all alive and I know it’s disgusting, but I love poking at people’s insides.",
                    "outcome": "",
                    "stats": {},
                    "eval": ""
                },
                {
                    "choice": "It was a whole new world, how could I not be drawn to find out absolutely everything about it.",
                    "outcome": "",
                    "stats": {
                        "education": 10,
                        "health": 10
                    },
                    "eval": ""
                },
                {
                    "choice": "There was an ocean. People needed to eat. So, I fished.",
                    "outcome": "",
                    "stats": {},
                    "eval": ""
                }
            ]
        },
        {
            "scenario": "<p>If it was there, I discovered it! I found new antibiotics, a cure for male pattern baldness, an insect that was really a fruit, silicon-based lifeforms, and around two thousand different types of fish. Our ancestor’s hadn’t hoped for much life in our new world, but it was teeming. We even found a new best friend for man.</p><p>Around a year in, the angler dogs wormed their way up the south shore, their glowing lanterns dangling in front of their dopey looking faces. It was mating season and when the parents had returned beneath the ocean, we went down to investigate. The young they left would have legs and feet until their adolescence, at which point they dropped off and the angler dogs went to make a life underwater.</p><p>Importantly, they were born with their light source. With no means to make a fire, our short nights felt long. So of course we took these cute little guys home to light up our little island.</p>",
            "choices": [
                {
                    "choice": "They sat on the porch of our seaweed shacks and ate our scraps.",
                    "outcome": "",
                    "stats": {},
                    "eval": ""
                },
                {
                    "choice": "Angler dogs were great for scarring the crabs from our barnacle beach homes.",
                    "outcome": "",
                    "stats": {},
                    "eval": ""
                },
                {
                    "choice": "Were given places of honour in our ice pyramids!",
                    "outcome": "",
                    "stats": {},
                    "eval": ""
                }
            ]
        },
        {
            "scenario": "<p>Let's choose a name yo.</p>",
            "choices": [
                {
                    "choice": "",
                    "outcome": "<p>A grand choice, everyone agrees.</p>",
                    "stats": {},
                    "eval": "planetName = events[eventNumber-1].choices[0].choice; select('#planetName').html(planetName);"
                },
                {
                    "choice": "",
                    "outcome": "<p>I mean, it's a bit iffy but I guess it's kinda fitting.</p>",
                    "stats": {},
                    "eval": "planetName = events[eventNumber-1].choices[1].choice; select('#planetName').html(planetName);"
                },
                {
                    "choice": "",
                    "outcome": "<p>Yeah buddy. That's a kickass name.</p>",
                    "stats": {},
                    "eval": "planetName = events[eventNumber-1].choices[2].choice; select('#planetName').html(planetName);"
                }
            ]
        }
    ],
    "events": [
    ]
}
